{
    "version": "https://jsonfeed.org/version/1",
    "title": "Studio for Research in Sound and Technology",
    "description": "",
    "home_page_url": "https://sound.risd.edu",
    "feed_url": "https://sound.risd.edu/feed.json",
    "user_comment": "",
    "author": {
        "name": "shawn greenlee"
    },
    "items": [
        {
            "id": "https://sound.risd.edu/booking-and-use.html",
            "url": "https://sound.risd.edu/booking-and-use.html",
            "title": "Booking &amp; use",
            "summary": "Rules on use Follow all COVID protocols (e.g. social distancing, face masks, hand sanitizing, etc., see https://covid.risd.edu/ ) Do not&hellip;",
            "content_html": "<h4>Rules on use</h4>\n<ul>\n<li>Follow all COVID protocols (e.g. social distancing, face masks, hand sanitizing, etc., see <a href=\"https://covid.risd.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">https://covid.risd.edu/</a> )</li>\n<li>Do not move or reposition the 25.4 array loudspeakers in any way. The system is calibrated to exact positions.  </li>\n<li><strong>No food</strong> in the studio. Drinks should be in container with lid and kept away from computers and equipment. Please clean up. Take trash to bins <strong>outside</strong> of studio.</li>\n<li>The permitted types of studio work are computer-based / electronic media production.</li>\n<li>The studio is a clean space. No materials or tools that produce dust or fumes are allowed. Fabrication should be done elsewhere.</li>\n<li>Do not hang anything from the ceiling grid or speakers.</li>\n<li>Do not pin, tape, or mount anything in any way to the walls or acoustic panels.</li>\n<li>Do not leave or store anything in the studio. Items left will be discarded.</li>\n<li>Do not remove equipment or furniture from the studio.</li>\n<li>The tables and chairs in the seminar area can be rearranged to accommodate usage needs. Please return to default state.</li>\n<li>Installations require special permission from studio management and coordination with faculty of studio courses.</li>\n<li>Work conducted in the studio may not cause or threaten physical harm to its occupants, equipment, or facilities.</li>\n<li>Failure to adhere to these policies can result in revoked access.</li>\n</ul>\n<h4>Reservations</h4>\n<p class=\"msg msg--success align-left\"><strong><a href=\"http://efs.bookedscheduler.com/Web/schedule.php?sid=13\" target=\"_blank\" rel=\"noopener noreferrer\">click to log in</a></strong></p>\n<ul>\n<li>Use of the studio is restricted to students enrolled in hosted courses and the associated faculty and staff.</li>\n<li>Use of the studio must be scheduled with the reservation system. Reservations can be made up until the current time. People that drop-in without making a reservation can be bumped. </li>\n<li>Access to studio and reservation system is only granted after an introductory lesson as part of course lessons.</li>\n</ul>\n<h4>Help</h4>\n<p class=\"msg--highlight msg  msg--success align-left\"><strong><a href=\"https://goo.gl/forms/LyAt2oGCibTXr0O43\" target=\"_blank\" rel=\"noopener noreferrer\">click to submit support ticket</a></strong></p>\n<ul>\n<li>There is no on-call support for 25.4 loudspeaker array. Submit a support ticket if a problem occurs.</li>\n<li>As part of coursework, students must learn to troubleshoot common problems.</li>\n<li>By submitting a ticket, you will alert studio management of problems encountered. These will be addressed as soon as possible. Support tickets are reviewed daily.</li>\n</ul>\n<p> </p>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
                   "Use"
            ],
            "date_published": "2021-08-16T14:22:11-04:00",
            "date_modified": "2022-07-01T11:04:28-04:00"
        },
        {
            "id": "https://sound.risd.edu/array.html",
            "url": "https://sound.risd.edu/array.html",
            "title": "25.4 loudspeaker array",
            "summary": "SRST has a sound system featuring an array of 25 independently-addressable, full-range speakers in a hemisphere configuration, accompanied by 4&hellip;",
            "content_html": "<p>SRST has a sound system featuring an array of 25 independently-addressable, full-range speakers in a hemisphere configuration, accompanied by 4 subwoofers.  A variety of spatial audio techniques are supported, including high order ambisonics, vector-based amplitude panning, multichannel surround, and 3D audio for immersive media.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/1/gallery/m11_array1-2.jpg\" data-size=\"1922x1281\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/1/gallery/m11_array1-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"499\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/1/gallery/m11_array2-2.jpg\" data-size=\"1920x1282\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/1/gallery/m11_array2-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"500\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/1/gallery/m11_array3-2.jpg\" data-size=\"1920x1282\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/1/gallery/m11_array3-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"500\"></a></figure>\n</div></div>\n<h2><strong>Loudspeakers and audio network</strong></h2>\n<ul>\n<li><a href=\"https://www.genelec.com/studio-monitors/8000-series-studio-monitors/8050b-studio-monitor\" target=\"_blank\" rel=\"noopener noreferrer\">25 Genelec 8050B studio monitors</a></li>\n<li><a href=\"https://www.genelec.com/support-technology/previous-models/hts4b-home-theater-subwoofer\" target=\"_blank\" rel=\"noopener noreferrer\">4 Genelec HTS4B home theater subwoofers</a></li>\n<li><a href=\"http://motu.com/products/avb/8m\" target=\"_blank\" rel=\"noopener noreferrer\">MOTU 8M AVB interface</a> (workstation)</li>\n<li><a href=\"http://motu.com/products/avb/1248\" target=\"_blank\" rel=\"noopener noreferrer\">MOTU 1248 AVB audio interface</a> (rack)</li>\n<li><a href=\"http://motu.com/products/avb/24ai-24ao\" target=\"_blank\" rel=\"noopener noreferrer\">MOTU 24Ao AVB audio interface</a> (rack)</li>\n<li><a href=\"http://motu.com/products/avb/avb-switch\" target=\"_blank\" rel=\"noopener noreferrer\">2 MOTU AVB switches</a> (rack)</li>\n</ul>\n<h2><strong>Workstation</strong></h2>\n<ul>\n<li><a href=\"https://www.apple.com/imac-pro/\" target=\"_blank\" rel=\"noopener noreferrer\">iMac Pro 27\" 3.0 GHz 10-core Intel Xeon, 128GB RAM, 2TB SSD</a></li>\n<li><a href=\"https://www.ableton.com/en/push/\" target=\"_blank\" rel=\"noopener noreferrer\">Ableton Push 2 controller</a></li>\n<li><a href=\"https://www.arturia.com/products/hybrid-synths/minilab-mkii/overview\" target=\"_blank\" rel=\"noopener noreferrer\">Arturia MiniLab MKII controllers</a></li>\n<li><a href=\"http://www.networksound.com/index.php/products/pbays/xlr\" target=\"_blank\" rel=\"noopener noreferrer\">Network Sound patchbay</a> (for MOTU 8m I/O)</li>\n<li><a href=\"https://www.azstudioworkstations.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Desk, custom AZ Studio Workstations</a></li>\n<li><a href=\"https://www.apple.com/imac/\" target=\"_blank\" rel=\"noopener noreferrer\">iMac 27\"</a> (desk adjacent to rack)</li>\n</ul>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2021-08-13T08:12:00-04:00",
            "date_modified": "2022-07-01T10:42:31-04:00"
        },
        {
            "id": "https://sound.risd.edu/software.html",
            "url": "https://sound.risd.edu/software.html",
            "title": "Software",
            "summary": "This is a listing of the audio software (beyond the RISD coreware) installed on the main workstation. The rack workstation&hellip;",
            "content_html": "<p>This is a listing of the audio software (beyond the RISD coreware) installed on the main workstation. The rack workstation does not match this listing.</p>\n<h4><strong>Programming</strong></h4>\n<ul>\n<li><a href=\"https://cycling74.com/products/max\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Max 8.*</a></li>\n<li><a href=\"https://supercollider.github.io\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Supercollider 3.*</a></li>\n<li><a href=\"http://msp.ucsd.edu/software.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Pd 0.52.*</a></li>\n</ul>\n<h4><strong>DAW</strong></h4>\n<ul>\n<li><a href=\"http://reaper.fm\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Reaper 6.*</a></li>\n<li><a href=\"https://www.ableton.com/en/live/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Ableton Live 11.*</a></li>\n</ul>\n<h4><strong>Libraries and plugins</strong></h4>\n<ul>\n<li>VST<a href=\"https://plugins.iem.at/\" target=\"_blank\" rel=\"noopener noreferrer\"> IEM</a></li>\n<li>VST <a href=\"http://research.spa.aalto.fi/projects/sparta_vsts/\" target=\"_blank\" rel=\"noopener noreferrer\">Sparta</a></li>\n<li>VST <a href=\"http://www.matthiaskronlachner.com/?p=2015\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Kronlachner ambiX</a></li>\n<li>VST <a href=\"https://www.brucewiggins.co.uk/?page_id=78\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Wigware </a></li>\n<li>VST/AU <a href=\"https://www.noisemakers.fr\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Noisemakers Ambi Bundle HD</a></li>\n<li>VST/AU <a href=\"https://harpex.net/\" target=\"_blank\" rel=\"noopener noreferrer\">Harpex</a></li>\n<li>Reaper/JSFX <a href=\"http://www.ambisonictoolkit.net/download/reaper/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Ambisonic Toolkit</a></li>\n<li>Ableton Live <a href=\"http://www.envelop.us/software/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Envelop (E4L)</a></li>\n<li>Supercollider <a href=\"http://www.ambisonictoolkit.net/download/supercollider/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Ambisonic Toolkit</a></li>\n<li>Max <a href=\"http://forumnet.ircam.fr/product/spat-en/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">IRCAM Spat 5</a></li>\n<li>Max <a href=\"https://www.zhdk.ch/downloads-ambisonics-externals-for-maxmsp-5381\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">ICST library</a></li>\n<li>Max <a href=\"http://ico.bukvic.net/main/d4/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">D4</a></li>\n<li>Max &amp; Pd <a href=\"http://www.zacharyseldess.com/miap/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">MIAP </a></li>\n</ul>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2021-08-13T07:30:00-04:00",
            "date_modified": "2022-07-01T10:51:23-04:00"
        },
        {
            "id": "https://sound.risd.edu/about.html",
            "url": "https://sound.risd.edu/about.html",
            "title": "About",
            "summary": "The Studio for Research in Sound and Technology (SRST) at the Rhode Island School of Design (RISD) provides an environment&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">The Studio for Research in Sound and Technology (SRST) at the Rhode Island School of Design (RISD) provides an environment for inquiry, technological innovation, and education in the sonic arts and sound design.  It serves as a hub for experimentation in design with and of sound, facilitating research in sonic interaction, experience, composition, and performance. The center hosts a selection of courses where sound or music technology factors as a central medium or subject of study, offers its own educational programs, and produces events that facilitate exchange among practitioners and the public.</span></p>\n<p>Found in 2018 as the Spatial Audio Studio and located at 15 Westminster St., SRST features an acoustically treated room with a 25.4 channel sound system, flexible seminar/work area, extensive digital composition tools, and a selection of hardware synthesizers including Serge modular and GRP. </p>\n<p>The sound system consists of an array of 25 independently-addressable, full-range speakers in a hemisphere configuration, accompanied by 4 subwoofers. The primary way of working with the array is through audio programming languages and digital audio software. A central computer workstation joined with audio network interfaces provides connectivity throughout the room, I/O expansion, and the main interface for composition, design, and performance. A variety of spatial audio techniques are supported, including high order ambisonics, vector-based amplitude panning, multichannel surround, and 3D audio for immersive media.  In 2022-23, the Studio will complete the design and build of a Wave Field Synthesis system.</p>\n<p>SRST provides an essential resource for curriculum and builds capacity for advanced sound studies and research engaging computation and audio technologies. The Studio supports a selection of courses offered by the interdisciplinary <a href=\"https://ctc.risd.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">Computation, Technology, and Culture concentration (CTC)</a> and the graduate <a href=\"https://dm.risd.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">Department of Digital + Media (D+M)</a>. As a workspace for projects, the Studio can be reserved by students enrolled in associated courses. As a site for research, the studio provides a hub for  faculty, staff, and student experimentation with outcomes aimed at peer review publication, presentation/performance at conferences and festivals, and other forms of exposition. Further, the studio hosts visiting lectures and workshops by designers, artists, and technologists; and provides a fresh context for exchanges with industry and cross-institutional research networks.<br><br><em>Please direct inquires to the Faculty Lead, Shawn Greenlee: sgreenle *at* risd *dot* edu</em></p>\n<p> </p>\n<p><br><br></p>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
            ],
            "date_published": "2019-03-12T22:15:52-04:00",
            "date_modified": "2022-07-01T10:58:09-04:00"
        },
        {
            "id": "https://sound.risd.edu/courses.html",
            "url": "https://sound.risd.edu/courses.html",
            "title": "Courses",
            "summary": "Spatial Audio CTC-2006: Fall 2022 Shawn Greenlee Spatial Audio focuses on the creation of immersive 3D sound experiences. In this&hellip;",
            "content_html": "<h4><strong>Spatial Audio</strong></h4>\n<p>CTC-2006: Fall 2022<br>Shawn Greenlee</p>\n<pre>Spatial Audio focuses on the creation of immersive 3D sound experiences. In this course, students analyze and explore how the sensation of space is activated in the listener by making works using spatial audio techniques. These methods include high-order ambisonics, vector-based amplitude panning, multichannel surround, and binaural audio, among others. Throughout the semester, a series of exercises addressing technical and theoretical issues provide students with the necessary experience to produce midterm and final projects. Coursework involves computational approaches to sound design and composition, with instruction in the audio programming language Max and digital audio workstations, i.e. Ableton Live and Reaper. Students have recurring access to a 25-channel loudspeaker array for the development of works. Readings from psychology, philosophy, the arts, and sound studies support class discussions and critiques. Students will need a laptop computer (Mac or Windows) and a Max software license (educational pricing available from cycling74.com). Previous experience with digital audio software recommended.</pre>\n<h4>Sonic Practices </h4>\n<p>DM-3104: Fall 2022 &amp; Spring 2023<br>Mark Cetilia (FA), Shawn Greenlee (SP)</p>\n<pre>Sonic Practices is a graduate-level research group focused on acoustic, electronic, and/or computer-based means of sound production and reception. Participants explore audio culture and technology while developing experimental approaches to composition, performance, recording, and/or listening. Areas of investigation include, but are not limited to: audio programming languages, embedded/mobile computing for sound and music, spatial audio, sound synthesis, audio electronics, sonification and auditory display, electroacoustic music composition and improvisation, field recording and soundscape studies, sound installation and performance, and sonic interaction design. Each semester, course content changes in response to a new unifying theme upon which students base individual and team-based research projects. Meetings consist of discussions, workshops, critiques, and collaborations that support students' individual inquiries, the exchange of ideas, and the exploration of research methodologies.</pre>\n<h4><strong>Sound Synthesis: Analog / Digital Hybrids</strong></h4>\n<p>CTC-2043: Spring 2023<br>Mark Cetilia</p>\n<pre>Throughout the past century, electronically generated sound has challenged the aesthetic and conceptual boundaries of art and music. In this intensive studio course, students will focus on the creation of experimental sound works utilizing hybrid analog / digital systems. We will investigate synthesis techniques using the SuperCollider programming language / environment in conjunction with the Serge modular synthesizer. Students will leverage the strengths of these tools towards uniquely personal production platforms that are more than the sum of their parts, and utilize them in the creation of fixed media, generative compositions, and improvised performances. The course will include discussion of historical works / texts, hands-on demonstrations, in-class projects, and critical engagement with new works by class members, culminating in a final project that incorporates knowledge gained throughout the semester. Students will need a laptop computer running a recent OS: Mac, Windows, or Linux. Previous programming experience is recommended, but not required.</pre>\n<h4><strong>Programming Sound: Performance Systems</strong></h4>\n<p>CTC-2001: Spring 2023<br>Shawn Greenlee</p>\n<pre>Programming Sound: Performance Systems focuses on programming and designing computer-based systems for sound art and music performance. Centered on the dataflow programming language, Pure Data (Pd), the course will be of substantial benefit to students who desire a rigorous and fast-moving foundation in algorithmic approaches to sound design. The course simultaneously facilitates explorations in sound synthesis, audio signal processing, electronics, mobile platforms, gesture-based human computer interaction, and instrument building with microcontrollers and sensors. Coursework involves weekly homework in the form of online lectures and exercises with class sessions reserved for demonstrations, workshops, and project assistance. The course emphasizes modularity and reuse of code. Students will present their work in a public concert during the last week of the semester. Additional notes: In order to conduct work in this course, students will need a laptop computer running a recent OS: Mac, Windows, or Linux. Previous programming experience is recommended, but not required. </pre>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
                   "Spatial audio studio"
            ],
            "date_published": "2018-07-18T08:32:18-04:00",
            "date_modified": "2022-07-01T10:15:02-04:00"
        },
        {
            "id": "https://sound.risd.edu/classroom.html",
            "url": "https://sound.risd.edu/classroom.html",
            "title": "Classroom support",
            "summary": "SRST has a dedicated seminar area which can be flexibly configured and supports audio-visual presentations independent from the 25.4 loudspeaker&hellip;",
            "content_html": "<p>SRST has a dedicated seminar area which can be flexibly configured and supports audio-visual presentations independent from the 25.4 loudspeaker array.</p>\n<div class=\"gallery-wrapper\"><div class=\"gallery\"  data-is-empty=\"false\" data-columns=\"3\">\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar1-2.jpg\" data-size=\"1920x1080\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar1-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"421\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar2-2.jpg\" data-size=\"1920x1080\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar2-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"421\"></a></figure>\n<figure class=\"gallery__item\"><a href=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar3-2.jpg\" data-size=\"1920x1080\"><img loading=\"lazy\" src=\"https://sound.risd.edu/media/posts/4/gallery/m11_seminar3-2-thumbnail.jpg\" alt=\"\" width=\"749\" height=\"421\"></a></figure>\n</div></div>\n<h4>Equipment</h4>\n<ul>\n<li><a href=\"https://pro.sony/ue_US/products/pro-displays/fw-65bz30j\" target=\"_blank\" rel=\"noopener noreferrer\">65\" Sony Bravia 4K TV display</a> FW-65BZ35F, wall mounted</li>\n<li><a href=\"https://pro.sony/ue_US/products/pro-displays/fw-75bz40h\" target=\"_blank\" rel=\"noopener noreferrer\">75\" Sony Bravia 4K TV display</a> FW-55BZ35F, cart mounted</li>\n<li><a href=\"https://www.genelec.com/studio-monitors/8000-series-studio-monitors/8050b-studio-monitor\" target=\"_blank\" rel=\"noopener noreferrer\">2 Genelec 8050B studio monitors</a>, wall mounted</li>\n<li><a href=\"https://www.crestron.com/Products/Video/All-In-One-Solutions/DigitalMedia-Presentation-Switchers/DMPS3-4K-150-C\" target=\"_blank\" rel=\"noopener noreferrer\">Crestron 4K DigitalMedia Presentation System DMPS3-4K-150-C </a></li>\n<li><a href=\"https://www.extron.com/product/dmp44lc\" target=\"_blank\" rel=\"noopener noreferrer\">Extron DMP 44LC, 4x4 digital matrix processor</a></li>\n<li><a href=\"https://tascam.com/us/product/model_16/top\" target=\"_blank\" rel=\"noopener noreferrer\">Tascam Model 16 Mixer / Interface / Recorder</a></li>\n<li>Video inputs, rack: HDMI, VGA</li>\n<li>Audio inputs, rack: HDMI, 3.5mm, balanced XLR (line-level)</li>\n<li>AV outputs, rack: HDMI, Assitive Listening System </li>\n</ul>\n<h4>Furniture</h4>\n<ul>\n<li>Dry-erase, magnetic presentation boards </li>\n<li><a href=\"https://www.hermanmiller.com/products/workspaces/collaborative-furniture/everywhere-tables/\" target=\"_blank\" rel=\"noopener noreferrer\">8 HermanMiller Flip-Top tables</a></li>\n<li><a href=\"https://www.hermanmiller.com/products/seating/stacking-chairs/caper-stacking-chair/\" target=\"_blank\" rel=\"noopener noreferrer\">18 HermanMiller Caper chairs</a></li>\n<li>14 Samson LTS50 laptop stands </li>\n<li>20 stools</li>\n</ul>",
            "author": {
                "name": "shawn greenlee"
            },
            "tags": [
                   "Resources"
            ],
            "date_published": "2018-07-18T08:31:41-04:00",
            "date_modified": "2022-07-01T11:10:27-04:00"
        }
    ]
}
